# Pandas

In [1]:
import pandas as pd

La estrucutura de pandas son:
* Series
* Dataframes
* Indices

## Pandas Series
Es un array unidimensional

In [2]:
pd.Series([1,2,3,15,28])

0     1
1     2
2     3
3    15
4    28
dtype: int64

In [3]:
pd.Series([1,2,3,15,28.0])

0     1.0
1     2.0
2     3.0
3    15.0
4    28.0
dtype: float64

In [4]:
datos=pd.Series([1,2,3,15,28])

In [5]:
datos.values

array([ 1,  2,  3, 15, 28], dtype=int64)

In [6]:
type(datos.values)

numpy.ndarray

In [7]:
datos.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
datos=pd.Series([1,2,3,15.0,'28'])

In [9]:
datos.values

array([1, 2, 3, 15.0, '28'], dtype=object)

In [10]:
datos[4]

'28'

In [11]:
datos[1]

2

In [12]:
datos[1:3]

1    2
2    3
dtype: object

In [13]:
nuevos_datos=pd.Series([10,8,7.5,4],index=['Mates',"Ingles","Lengua","Ed_Fisica"])

In [14]:
nuevos_datos

Mates        10.0
Ingles        8.0
Lengua        7.5
Ed_Fisica     4.0
dtype: float64

In [15]:
nuevos_datos[2]

7.5

In [16]:
nuevos_datos['Mates']

10.0

In [17]:
alumnos={"Cono":10,"Jose":9.5,"Gonzalo":0,"Leticia":9.7}

In [18]:
alumnos

{'Cono': 10, 'Jose': 9.5, 'Gonzalo': 0, 'Leticia': 9.7}

In [19]:
alumnos_series=pd.Series(alumnos)

In [20]:
alumnos_series

Cono       10.0
Jose        9.5
Gonzalo     0.0
Leticia     9.7
dtype: float64

### DataFrame

In [21]:
alumnos_Asistencia=pd.Series({"Cono":97,"Jose":95,"Gonzalo":100,"Leticia":80})

In [22]:
pd.DataFrame({"Notas":alumnos_series,"Asistencia":alumnos_Asistencia})

         Notas  Asistencia
Cono      10.0          97
Jose       9.5          95
Gonzalo    0.0         100
Leticia    9.7          80

In [23]:
boot=pd.DataFrame({"Notas":alumnos_series,"Asistencia":alumnos_Asistencia})

In [24]:
boot.index

Index(['Cono', 'Jose', 'Gonzalo', 'Leticia'], dtype='object')

In [25]:
boot.columns

Index(['Notas', 'Asistencia'], dtype='object')

In [26]:
boot["Nueva_Columna"]=boot["Notas"]*0.3+boot["Asistencia"]

In [27]:
boot

         Notas  Asistencia  Nueva_Columna
Cono      10.0          97         100.00
Jose       9.5          95          97.85
Gonzalo    0.0         100         100.00
Leticia    9.7          80          82.91

In [28]:
import numpy as np
np.random.rand(3,2)

array([[0.33475431, 0.74325024],
       [0.67129435, 0.51796077],
       [0.12781785, 0.2942331 ]])

In [29]:
pd.DataFrame(np.random.rand(3,2),columns=["col1","col2"],index=["ind1","ind2","ind3"])

          col1      col2
ind1  0.105835  0.192826
ind2  0.593097  0.431374
ind3  0.748653  0.674514

In [30]:
datos=[{'a':i,'b':2*i} for i in range(4)]

In [31]:
datos

[{'a': 0, 'b': 0}, {'a': 1, 'b': 2}, {'a': 2, 'b': 4}, {'a': 3, 'b': 6}]

In [32]:
df=pd.DataFrame(datos)

In [33]:
df

   a  b
0  0  0
1  1  2
2  2  4
3  3  6

In [34]:
df.columns=["Usuario","Numero"]

In [35]:
df

   Usuario  Numero
0        0       0
1        1       2
2        2       4
3        3       6

In [36]:
A=np.zeros(20,dtype=[("usuario",'i8'),('Numero','f8')])

In [37]:
A

array([(0, 0.), (0, 0.), (0, 0.), (0, 0.), (0, 0.), (0, 0.), (0, 0.),
       (0, 0.), (0, 0.), (0, 0.), (0, 0.), (0, 0.), (0, 0.), (0, 0.),
       (0, 0.), (0, 0.), (0, 0.), (0, 0.), (0, 0.), (0, 0.)],
      dtype=[('usuario', '<i8'), ('Numero', '<f8')])

In [38]:
type(A)

numpy.ndarray

In [39]:
df_A=pd.DataFrame(A)

In [40]:
df_A

    usuario  Numero
0         0     0.0
1         0     0.0
2         0     0.0
3         0     0.0
4         0     0.0
5         0     0.0
6         0     0.0
7         0     0.0
8         0     0.0
9         0     0.0
10        0     0.0
11        0     0.0
12        0     0.0
13        0     0.0
14        0     0.0
15        0     0.0
16        0     0.0
17        0     0.0
18        0     0.0
19        0     0.0

In [41]:
df_A.head()

   usuario  Numero
0        0     0.0
1        0     0.0
2        0     0.0
3        0     0.0
4        0     0.0

In [42]:
df_A.tail()

    usuario  Numero
15        0     0.0
16        0     0.0
17        0     0.0
18        0     0.0
19        0     0.0

In [43]:
df_A.sample(5)

    usuario  Numero
6         0     0.0
1         0     0.0
8         0     0.0
10        0     0.0
4         0     0.0

In [44]:
df_A[12]

KeyError: 12

In [ ]:
df_A.loc[12]

usuario    0.0
Numero     0.0
Name: 12, dtype: float64

In [ ]:
df_A.iloc[12]

usuario    0.0
Numero     0.0
Name: 12, dtype: float64

In [ ]:
df_A.iloc[0,5]

IndexError: index 5 is out of bounds for axis 0 with size 2

In [ ]:
df_A.loc[[0,5]]

   usuario  Numero
0        0     0.0
5        0     0.0

In [ ]:
df_A.iloc[[0,5]]

   usuario  Numero
0        0     0.0
5        0     0.0

In [ ]:
Area=pd.Series({'Madrid':1234,'Barcelona':2345,'Sevilla':3456,'Granada':4567})
pobla=pd.Series({'Madrid':123400,'Barcelona':23450,'Sevilla':34560,'Granada':1234})

In [ ]:
df_S=pd.DataFrame({'Area':Area,"Poblacion":pobla})

In [ ]:
df_S

           Area  Poblacion
Madrid     1234     123400
Barcelona  2345      23450
Sevilla    3456      34560
Granada    4567       1234

In [ ]:
df_S["Area"]

Madrid       1234
Barcelona    2345
Sevilla      3456
Granada      4567
Name: Area, dtype: int64

In [ ]:
df_S["Poblacion"]

Madrid       123400
Barcelona     23450
Sevilla       34560
Granada        1234
Name: Poblacion, dtype: int64

In [ ]:
df_S["Densidad"]=df_S["Poblacion"]/df_S["Area"]

In [ ]:
df_S

           Area  Poblacion    Densidad
Madrid     1234     123400  100.000000
Barcelona  2345      23450   10.000000
Sevilla    3456      34560   10.000000
Granada    4567       1234    0.270199

In [ ]:
df_S.loc["Barcelona"]

Area          2345.0
Poblacion    23450.0
Densidad        10.0
Name: Barcelona, dtype: float64

In [ ]:
df_S.iloc[1]

Area          2345.0
Poblacion    23450.0
Densidad        10.0
Name: Barcelona, dtype: float64

In [ ]:
df_S.loc["Granada","Densidad"]

0.27019925552879354

In [ ]:
df_S.iloc[3]["Densidad"]

0.27019925552879354

In [ ]:
df_S.iloc[3,2]

0.27019925552879354

In [ ]:
df_S

           Area  Poblacion    Densidad
Madrid     1234     123400  100.000000
Barcelona  2345      23450   10.000000
Sevilla    3456      34560   10.000000
Granada    4567       1234    0.270199

In [ ]:
df_S[df_S["Densidad"]<10]

         Area  Poblacion  Densidad
Granada  4567       1234  0.270199

In [ ]:
df_S.loc[df_S["Densidad"]<10,["Area","Poblacion"]]

         Area  Poblacion
Granada  4567       1234

In [ ]:
df_S.loc["Granada","Poblacion"]=1235

In [ ]:
df_S

           Area  Poblacion    Densidad
Madrid     1234     123400  100.000000
Barcelona  2345      23450   10.000000
Sevilla    3456      34560   10.000000
Granada    4567       1235    0.270199

In [ ]:
df_S.loc["Granada","Densidad"]=df_S.loc["Granada","Poblacion"]/df_S.loc["Granada","Area"]

In [ ]:
df_S

           Area  Poblacion    Densidad
Madrid     1234     123400  100.000000
Barcelona  2345      23450   10.000000
Sevilla    3456      34560   10.000000
Granada    4567       1235    0.270418

In [ ]:
pd.read_csv('./Ficheros_CSV/heart.csv')

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

In [46]:
import pandas as pd
corazon=pd.read_csv('./Ficheros_CSV/heart.csv')

In [47]:
corazon.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

In [48]:
corazon.columns

Index(['age', 'sex', 'cp', 'trestbps', 'chol', 'fbs', 'restecg', 'thalach',
       'exang', 'oldpeak', 'slope', 'ca', 'thal', 'target'],
      dtype='object')

In [49]:
corazon["oldpeak"].max()

6.2

In [50]:
corazon["oldpeak"].min()

0.0

### Ejercicio
Calcular el máximo, minimo y media de cada una de las columnas, excepto la columna target

In [51]:
## Solución
sol=pd.DataFrame(columns=corazon.columns)

In [52]:
sol

Empty DataFrame
Columns: [age, sex, cp, trestbps, chol, fbs, restecg, thalach, exang, oldpeak, slope, ca, thal, target]
Index: []

In [53]:
sol.columns

Index(['age', 'sex', 'cp', 'trestbps', 'chol', 'fbs', 'restecg', 'thalach',
       'exang', 'oldpeak', 'slope', 'ca', 'thal', 'target'],
      dtype='object')

In [54]:
for i in sol.columns:
    print(i)

age
sex
cp
trestbps
chol
fbs
restecg
thalach
exang
oldpeak
slope
ca
thal
target

In [55]:
for col in sol.columns:
    if col !='target':
        sol.loc["minimo",col]=corazon[col].min()
        sol.loc["maximo",col]=corazon[col].max()
        sol.loc["media",col]=corazon[col].mean()

In [56]:
sol

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
minimo,29,0,0,94,126,0,0,71,0,0.0,0,0,0,NaN
maximo,77,1,3,200,564,1,2,202,1,6.2,2,4,3,NaN
media,54.366337,0.683168,0.966997,131.623762,246.264026,0.148515,0.528053,149.646865,0.326733,1.039604,1.39934,0.729373,2.313531,NaN

In [57]:
###
del sol["target"]

In [58]:
sol

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal
minimo,29,0,0,94,126,0,0,71,0,0.0,0,0,0
maximo,77,1,3,200,564,1,2,202,1,6.2,2,4,3
media,54.366337,0.683168,0.966997,131.623762,246.264026,0.148515,0.528053,149.646865,0.326733,1.039604,1.39934,0.729373,2.313531

In [59]:
sol_target=sol.drop(columns="target")

KeyError: "['target'] not found in axis"

In [ ]:
sol

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
minimo,29,0,0,94,126,0,0,71,0,0.0,0,0,0,NaN
maximo,77,1,3,200,564,1,2,202,1,6.2,2,4,3,NaN
media,54.366337,0.683168,0.966997,131.623762,246.264026,0.148515,0.528053,149.646865,0.326733,1.039604,1.39934,0.729373,2.313531,NaN

In [ ]:
sol_target

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal
minimo,29,0,0,94,126,0,0,71,0,0.0,0,0,0
maximo,77,1,3,200,564,1,2,202,1,6.2,2,4,3
media,54.366337,0.683168,0.966997,131.623762,246.264026,0.148515,0.528053,149.646865,0.326733,1.039604,1.39934,0.729373,2.313531

In [ ]:
sol.drop(columns="target",inplace=True)

In [ ]:
sol

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal
minimo,29,0,0,94,126,0,0,71,0,0.0,0,0,0
maximo,77,1,3,200,564,1,2,202,1,6.2,2,4,3
media,54.366337,0.683168,0.966997,131.623762,246.264026,0.148515,0.528053,149.646865,0.326733,1.039604,1.39934,0.729373,2.313531

In [62]:
corazon.shape

(303, 14)

In [64]:
### para comprobar valores nulos 
corazon.notnull().sum()

age         303
sex         303
cp          303
trestbps    303
chol        303
fbs         303
restecg     303
thalach     303
exang       303
oldpeak     303
slope       303
ca          303
thal        303
target      303
dtype: int64

In [65]:
corazon[corazon.notnull()]

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

In [66]:
## valores perdidos
#valores nan
corazon.dropna()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

In [67]:
import numpy as np

In [68]:
np.nan

nan

In [69]:
df=pd.DataFrame([[1,np.nan,2],[2,3,4],[np.nan,7,6]])

In [70]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  4
2  NaN  7.0  6

In [71]:
df.dropna()

     0    1  2
1  2.0  3.0  4

In [72]:
## axis
df.dropna(axis="columns")

   2
0  2
1  4
2  6

In [73]:
df[4]=np.nan

In [74]:
df

     0    1  2   4
0  1.0  NaN  2 NaN
1  2.0  3.0  4 NaN
2  NaN  7.0  6 NaN

In [77]:
df.dropna(axis="columns")

   2
0  2
1  4
2  6

In [78]:
df.dropna(how="all",axis="columns")

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  4
2  NaN  7.0  6

In [79]:
## parametro tresh
df.dropna(axis="rows",thresh=3)

     0    1  2   4
1  2.0  3.0  4 NaN

In [80]:
df.dropna(axis="rows",thresh=2)

     0    1  2   4
0  1.0  NaN  2 NaN
1  2.0  3.0  4 NaN
2  NaN  7.0  6 NaN

In [81]:
## Rellenar
df_relleno=df.fillna(0)

In [82]:
df_relleno

     0    1  2    4
0  1.0  0.0  2  0.0
1  2.0  3.0  4  0.0
2  0.0  7.0  6  0.0

In [83]:
## relllenar con el valor anterior
df_anterior=df.fillna(method="ffill")

In [84]:
df_anterior

     0    1  2   4
0  1.0  NaN  2 NaN
1  2.0  3.0  4 NaN
2  2.0  7.0  6 NaN

In [85]:
## rellenar con el posterior
df.fillna(method="bfill")

     0    1  2   4
0  1.0  3.0  2 NaN
1  2.0  3.0  4 NaN
2  NaN  7.0  6 NaN

In [87]:
df.fillna(method="bfill",axis="columns")

     0    1    2   4
0  1.0  2.0  2.0 NaN
1  2.0  3.0  4.0 NaN
2  7.0  7.0  6.0 NaN

In [89]:
df

     0    1  2   4
0  1.0  NaN  2 NaN
1  2.0  3.0  4 NaN
2  NaN  7.0  6 NaN

In [88]:
df.fillna(method="ffill",axis="columns")

     0    1    2    4
0  1.0  1.0  2.0  2.0
1  2.0  3.0  4.0  4.0
2  NaN  7.0  6.0  6.0

In [90]:
df1=pd.DataFrame([[1,5,6],[2,5,7],[7,8,9]])

In [95]:
df1

   0  1  2
0  1  5  6
1  2  5  7
2  7  8  9

In [93]:
df[4]=df1[0]

In [94]:
df

     0    1  2  4
0  1.0  NaN  2  1
1  2.0  3.0  4  2
2  NaN  7.0  6  7

In [96]:
df[3]=np.nan

In [98]:
df1

   0  1  2
0  1  5  6
1  2  5  7
2  7  8  9

In [97]:
df.fillna(df1[1])

     0    1  2  4   3
0  1.0  5.0  2  1 NaN
1  2.0  3.0  4  2 NaN
2  5.0  7.0  6  7 NaN

In [100]:
df.fillna(df.mean(),axis="rows")

     0    1  2  4   3
0  1.0  5.0  2  1 NaN
1  2.0  3.0  4  2 NaN
2  1.5  7.0  6  7 NaN

In [112]:
df=df.append([[1,2,3,4,6]])

C:\Users\Daniel Montes\AppData\Local\Temp\ipykernel_5212\269924064.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=df.append([[1,2,3,4,6]])

In [114]:
df.reset_index()

   index    0    1  2  4    3
0      0  1.0  NaN  2  1  NaN
1      1  2.0  3.0  4  2  NaN
2      2  NaN  7.0  6  7  NaN
3      0  1.0  2.0  3  6  4.0

In [116]:
df2=df.reset_index(drop=True)

In [117]:
df2

     0    1  2  4    3
0  1.0  NaN  2  1  NaN
1  2.0  3.0  4  2  NaN
2  NaN  7.0  6  7  NaN
3  1.0  2.0  3  6  4.0

In [118]:
df.fillna(df.mean(),axis="rows")

          0    1  2  4    3
0  1.000000  4.0  2  1  4.0
1  2.000000  3.0  4  2  4.0
2  1.333333  7.0  6  7  4.0
0  1.000000  2.0  3  6  4.0

In [119]:
df.fillna(df.mean(),axis="columns")

NotImplementedError: Currently only can fill with dict/Series column by column

In [120]:
df.fillna(df.mean())

          0    1  2  4    3
0  1.000000  4.0  2  1  4.0
1  2.000000  3.0  4  2  4.0
2  1.333333  7.0  6  7  4.0
0  1.000000  2.0  3  6  4.0

In [121]:
df2

     0    1  2  4    3
0  1.0  NaN  2  1  NaN
1  2.0  3.0  4  2  NaN
2  NaN  7.0  6  7  NaN
3  1.0  2.0  3  6  4.0

In [124]:
df2["Total"]=df2.sum(axis="columns")

In [125]:
df2

     0    1  2  4    3  Total
0  1.0  NaN  2  1  NaN    4.0
1  2.0  3.0  4  2  NaN   11.0
2  NaN  7.0  6  7  NaN   20.0
3  1.0  2.0  3  6  4.0   16.0

In [127]:
orden=[0,1,2,3,4,"Total"]
df2[orden]

     0    1  2    3  4  Total
0  1.0  NaN  2  NaN  1    4.0
1  2.0  3.0  4  NaN  2   11.0
2  NaN  7.0  6  NaN  7   20.0
3  1.0  2.0  3  4.0  6   16.0

In [129]:
### ordenar la columna 0 y solo ver la columna 0
df2[0].sort_values()

0    1.0
3    1.0
1    2.0
2    NaN
Name: 0, dtype: float64

In [131]:
df2[0].sort_values(ascending=False)

1    2.0
0    1.0
3    1.0
2    NaN
Name: 0, dtype: float64

In [133]:
df2.sort_values(by=[2])

     0    1  2  4    3  Total
0  1.0  NaN  2  1  NaN    4.0
3  1.0  2.0  3  6  4.0   16.0
1  2.0  3.0  4  2  NaN   11.0
2  NaN  7.0  6  7  NaN   20.0

In [138]:
df3=df2.append([[1,2,3,4,5]])

C:\Users\Daniel Montes\AppData\Local\Temp\ipykernel_5212\1576943421.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df3=df2.append([[1,2,3,4,5]])

In [140]:
df3

     0    1  2  4    3  Total
0  1.0  NaN  2  1  NaN    4.0
1  2.0  3.0  4  2  NaN   11.0
2  NaN  7.0  6  7  NaN   20.0
3  1.0  2.0  3  6  4.0   16.0
0  1.0  2.0  3  5  4.0    NaN

In [141]:
df3.sort_values(by=[2,4],ascending=(True,False))

     0    1  2  4    3  Total
0  1.0  NaN  2  1  NaN    4.0
3  1.0  2.0  3  6  4.0   16.0
0  1.0  2.0  3  5  4.0    NaN
1  2.0  3.0  4  2  NaN   11.0
2  NaN  7.0  6  7  NaN   20.0

In [142]:
df3.sort_index()

     0    1  2  4    3  Total
0  1.0  NaN  2  1  NaN    4.0
0  1.0  2.0  3  5  4.0    NaN
1  2.0  3.0  4  2  NaN   11.0
2  NaN  7.0  6  7  NaN   20.0
3  1.0  2.0  3  6  4.0   16.0